app/views/users/index.html.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  .col-sm-6.user_att
    %h2= User.find(params[:id]).email