app/views/users/show.html.haml

SELECT  1 AS one FROM "photos" WHERE "photos"."user_id" = ? LIMIT 1  [["user_id", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]
---
.row
  - if !@user.photos.empty?

SELECT "tags".* FROM "tags" WHERE "tags"."photo_id" = ?  [["photo_id", 1]]
---
            = f.submit "Tag User"
          - photo.tags.each do |tag|

SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 1]]
---
          %br
          - photo.comments.each do |comment|