app/views/photos/show.html.haml

%h2{:align => "left"}#{"Comments for image with title: " + @photo.title}
-@photo.comments.order(created_at: :desc).each do |comment|
---
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  ORDER BY "comments"."created_at" DESC  [["photo_id", 2]]