app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("user_id", "photo_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["photo_id", 1], ["body", "hello california\r\n"], ["created_at", "2021-01-03 16:25:54.587964"], ["updated_at", "2021-01-03 16:25:54.587964"]]
---
  def create
    @user = User.find(params[:comment][:user_id])
    @comment = Comment.create({user_id: params[:comment][:user_id], photo_id: params[:comment][:photo_id], body: params[:comment][:body]})