app/controllers/follows_controller.rb

  def destroy
    @rel = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]