app/controllers/photos_controller.rb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @comment = Comment.new
    @photo = Photo.find(params[:id])
    @user = User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "photos" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "fvsf"], ["created_at", "2021-01-09 13:52:31.519743"], ["updated_at", "2021-01-09 13:52:31.519743"]]
UPDATE "photos" SET "user_id" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["user_id", 1], ["updated_at", "2021-01-03 16:25:11.486057"], ["id", 1]]
---
  def create
    @user = User.find(params[:user_id])
    if params[:photo] == nil

      flash[:alert] = "Please upload a photo"
      redirect_to :back
    else
    @photo = Photo.create(photo_params)
      @photo.user_id = @user.id
      @photo.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 8]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 8]]
---
  def destroy
    @user = User.find(params[:user_id])
    @photo = Photo.find(params[:id])
    @photo.destroy